[
  {
    "name": "Lễ hội Đống Đa",
    "id": "https://vi.wikipedia.org/wiki/G%C3%B2_%C4%90%E1%BB%91ng_%C4%90a",
    "start_date_lunar_calendar": "5/1",
    "location": "Hà Nội, quận Đống Đa",
    "held_for_first_time": "",
    "related_character": "Nguyễn Huệ",
    "detail": "Gò Đống Đa là một gò đất và là một di tích nằm bên phố Tây Sơn, phường Quang Trung, quận Đống Đa, Thành phố Hà Nội. Tại đây năm 1789 quân Tây Sơn đã đại phá và đánh thắng quân nhà Thanh Trung Quốc trong Trận Ngọc Hồi - Đống Đa\n"
  },
  {
    "name": "Hội vật Liễu Đôi",
    "id": "https://vi.wikipedia.org/w/index.php?title\u003dH%E1%BB%99i_v%E1%BA%ADt_Li%E1%BB%85u_%C4%90%C3%B4i\u0026action\u003dedit\u0026redlink\u003d1",
    "start_date_lunar_calendar": "5/1",
    "location": "Hà Nam, huyện Thanh Liêm",
    "held_for_first_time": "",
    "related_character": "",
    "detail": ""
  },
  {
    "name": "hội Gióng Sóc Sơn",
    "id": "https://vi.wikipedia.org/wiki/S%C3%B3c_S%C6%A1n",
    "start_date_lunar_calendar": "6/1",
    "location": "Hà Nội, Sóc Sơn",
    "held_for_first_time": "Nhà Tiền Lê",
    "related_character": "Thánh Gióng",
    "detail": "Sóc Sơn là một huyện nằm ở phía bắc thành phố Hà Nội, Việt Nam.\n"
  },
  {
    "name": "Lễ hội Cổ Loa",
    "id": "https://vi.wikipedia.org/wiki/C%E1%BB%95_Loa",
    "start_date_lunar_calendar": "6/1",
    "location": "Hà Nội, Đông Anh",
    "held_for_first_time": "",
    "related_character": "An Dương Vương",
    "detail": "Thành Cổ Loa là kinh đô của nhà nước Âu Lạc dưới thời An Dương Vương vào khoảng thế kỷ thứ 3 trước Công nguyên và của nhà nước phong kiến dưới thời Ngô Quyền thế kỷ 10 tại vùng đất xã Cổ Loa, huyện Đông Anh, Hà Nội.\n"
  },
  {
    "name": "Lễ hội chùa Bái Đính",
    "id": "https://vi.wikipedia.org/wiki/Ch%C3%B9a_B%C3%A1i_%C4%90%C3%ADnh#Lễ_hội_chùa_Bái_Đính",
    "start_date_lunar_calendar": "6/1",
    "location": "Ninh Bình, Gia Viễn",
    "held_for_first_time": "",
    "related_character": "",
    "detail": "Chùa Bái Đính là một quần thể chùa lớn với nhiều kỷ lục châu Á và Việt Nam được xác lập như chùa có tượng Phật bằng đồng dát vàng lớn nhất châu Á, chùa có hành lang La Hán dài nhất châu Á,[2][3] có tượng Di lặc bằng đồng lớn nhất Đông Nam Á... Đây là ngôi chùa lớn nhất và sở hữu nhiều kỷ lục nhất ở Việt Nam. Các hạng mục xây dựng, mở rộng khu chùa mới được các đại biểu tham dự đại lễ Phật đản thế giới 2008 làm lễ khánh thành giai đoạn 1, năm 2010 chùa Bái Đính là nơi tổ chức Đại lễ cung nghinh xá lợi Phật đầu tiên từ Ấn Độ về Việt Nam. Đại lễ Phật đản Liên hiệp quốc - Vesak 2014 do Việt Nam đăng cai đã diễn ra tại chùa Bái Đính trong tháng 3 năm 2014.[4] Chùa nằm ở cửa ngõ phía tây khu di tích cố đô Hoa Lư, bên quốc lộ 38B, thuộc xã Gia Sinh - Gia Viễn - Ninh Bình, cách thành phố Ninh Bình 15 km, cách Hà Nội 95 km. Chùa Bái Đính nằm ở phía bắc của quần thể di sản thế giới Tràng An.\n"
  },
  {
    "name": "Chợ Viềng",
    "id": "https://vi.wikipedia.org/wiki/Ch%E1%BB%A3_Vi%E1%BB%81ng",
    "start_date_lunar_calendar": "7/1",
    "location": "Nam Định, Vụ Bản",
    "held_for_first_time": "",
    "related_character": "",
    "detail": "Chợ Viềng (lối gọi theo tiếng cổ của Chợ Xuân) là phiên chợ đầu năm họp vào đêm mùng 7 ngày mùng 8 ở Nam Định. Theo gia phả họ Trần thì chợ Viềng có từ thời cổ xưa và hình thành theo tục lệ làng xã của người dân địa phương. Từ \" Viềng\" là từ Hán Việt có nghĩa là: thăm hỏi, viếng thăm, trò chuyện. Nam Định có 4 chợ đó là:\n"
  },
  {
    "name": "Lễ hội đầm Ô Loan",
    "id": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_%C4%91%E1%BA%A7m_%C3%94_Loan",
    "start_date_lunar_calendar": "7/1",
    "location": "Phú Yên, Ô Loan",
    "held_for_first_time": "",
    "related_character": "",
    "detail": "Lễ hội đầm Ô Loan được tổ chức vào mùng 7 tháng Giêng (Âm lịch) tại thôn Phú Tân, xã An Cư, huyện Tuy An. Lễ hội này có tư cách là lễ hội cầu ngư của người dân quanh đầm Ô Loan.\n"
  },
  {
    "name": "Đại lễ Đức Chí Tôn",
    "id": "https://vi.wikipedia.org/w/index.php?title\u003d%C4%90%E1%BA%A1i_l%E1%BB%85_%C4%90%E1%BB%A9c_Ch%C3%AD_T%C3%B4n\u0026action\u003dedit\u0026redlink\u003d1",
    "start_date_lunar_calendar": "",
    "location": "Tây Ninh, Đạo Cao Đài",
    "held_for_first_time": "",
    "related_character": "Đức Chí Tôn",
    "detail": ""
  },
  {
    "name": "Hội xuân Yên Tử",
    "id": "https://vi.wikipedia.org/w/index.php?title\u003dH%E1%BB%99i_xu%C3%A2n_Y%C3%AAn_T%E1%BB%AD\u0026action\u003dedit\u0026redlink\u003d1",
    "start_date_lunar_calendar": "10/1",
    "location": "Quảng Ninh, núi Yên Tử",
    "held_for_first_time": "",
    "related_character": "Trần Nhân Tông",
    "detail": ""
  },
  {
    "name": "Hội phết Hiền Quan",
    "id": "https://vi.wikipedia.org/wiki/H%E1%BB%99i_ph%E1%BA%BFt_Hi%E1%BB%81n_Quan",
    "start_date_lunar_calendar": "13/1",
    "location": "Phú Thọ, huyện Tam Nông",
    "held_for_first_time": "",
    "related_character": "Thiều Hoa công chúa, tứ vị đại tần họ Hà (Hà Hắc Long, Hà Hiên Cương, Hà Thổ Lân và Hà Sơn Thắng), hai tướng công : Bùi Thạch Đa và Bùi Thạch Đê.",
    "detail": "Hội Phết Hiền Quan là một lễ hội của xã Hiền Quan, huyện Tam Nông, tỉnh Phú Thọ, được tổ chức từ ngày 12 đến 13 tháng Giêng âm lịch hàng năm, trong đó ngày chính hội là ngày 13. Lễ hội được tổ chức nhằm tôn vinh tinh thần thượng võ và tưởng nhớ hai vị thành hoàng là Thiều Hoa công chúa, một nữ tướng dưới thời Hai Bà Trưng có công đánh giặc[1] và Mộc Trang đại vương thời nhà Đinh có công dẹp loạn 12 sứ quân.[2]\n"
  },
  {
    "name": "Hội Lim",
    "id": "https://vi.wikipedia.org/wiki/H%E1%BB%99i_Lim",
    "start_date_lunar_calendar": "13/1",
    "location": "Bắc Ninh, huyện Tiên Du",
    "held_for_first_time": "Nhà Lê sơ",
    "related_character": "Nguyễn Đình Diễn",
    "detail": "Hội Lim là một lễ hội lớn của tỉnh Bắc Ninh, chính hội được tổ chức vào ngày 13 tháng giêng hàng năm trên địa bàn huyện Tiên Du, tỉnh Bắc Ninh. Hội Lim được coi là nét kết tinh độc đáo của vùng văn hoá Kinh Bắc.\n"
  },
  {
    "name": "Lễ hội chùa Hương",
    "id": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_ch%C3%B9a_H%C6%B0%C6%A1ng",
    "start_date_lunar_calendar": "6/1",
    "location": "Hà Nội, huyện Mỹ Đức",
    "held_for_first_time": "",
    "related_character": "Quan Thế Âm Bồ Tát",
    "detail": "Lễ hội chùa Hương hay Trẩy hội chùa Hương là một lễ hội của Việt Nam, nằm ở Mỹ Đức, Hà Nội. Trong khu thắng cảnh Hương Sơn, được xem hành trình về một miền đất Phật - nơi Quan Thế Âm Bồ Tát ứng hiện tu hành. Đây là một lễ hội lớn về số lượng các phật tử tham gia hành hương.\n"
  },
  {
    "name": "Hội chùa Côn Sơn",
    "id": "https://vi.wikipedia.org/wiki/Ch%C3%B9a_C%C3%B4n_S%C6%A1n",
    "start_date_lunar_calendar": "15/1",
    "location": "Hải Dương, huyện Chí Linh",
    "held_for_first_time": "",
    "related_character": "Huyền Quang, Nguyễn Trãi",
    "detail": "Chùa Côn Sơn (tên chữ là Tư Phúc tự hay Côn Sơn Tự), còn gọi là chùa Hun, là một ngôi chùa nằm bên ngọn núi Côn Sơn (hay còn gọi là núi Hun) ở phường Cộng Hoà, thành phố Chí Linh, tỉnh Hải Dương, Việt Nam. Chùa đã được Bộ trưởng Bộ Văn hóa Việt Nam Dân chủ cộng hòa xếp hạng di tích quốc gia ngay trong đợt I năm 1962[4]. Đây là di tích quan trọng thuộc khu di tích Côn Sơn - Kiếp Bạc được công nhận là di tích quốc gia đặc biệt năm 2012.[5]\n"
  },
  {
    "name": "Lễ hội làm chay",
    "id": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_l%C3%A0m_chay",
    "start_date_lunar_calendar": "14/1",
    "location": "Long An, thị trấn Tầm Vu",
    "held_for_first_time": "",
    "related_character": "Đỗ Tường Phong, Đỗ Tường Tự",
    "detail": "Lễ hội làm chay – hay Lễ hội làm trai là một lễ hội tập tục địa phương hàng năm của nhân dân thị trấn Tầm Vu (Châu Thành, Long An) tổ chức lễ hội làm chay vào thời điểm trung tuần tháng Giêng âm lịch (diễn ra từ 14-16/1 âm lịch). Từ làm chay xuất phát từ chữ đọc trại của từ làm trai đàn do người miền Nam phát âm sai chữ tr và ch mà ra.\n"
  },
  {
    "name": "Tết Nguyên tiêu",
    "id": "https://vi.wikipedia.org/wiki/T%E1%BA%BFt_Nguy%C3%AAn_ti%C3%AAu",
    "start_date_lunar_calendar": "15/1",
    "location": "Nhiều quốc gia",
    "held_for_first_time": "",
    "related_character": "",
    "detail": "Tết Nguyên Tiêu (Chữ Nho: 節元宵)[1], Tết Thượng Nguyên, Rằm Tháng Giêng là ngày lễ hội truyền thống của Việt Nam và Trung Quốc [2][3]. Lễ hội trăng rằm từ giữa đêm 14 (đêm trước trăng rằm) trọn ngày 15 (ngày rằm) cho đến nửa đêm 15 (đêm trăng rằm) của tháng giêng Âm lịch.\n"
  },
  {
    "name": "Lễ hội chọi trâu",
    "id": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_ch%E1%BB%8Di_tr%C3%A2u_H%E1%BA%A3i_L%E1%BB%B1u",
    "start_date_lunar_calendar": "16/1",
    "location": "Vĩnh Phúc, huyện Lập Thạch",
    "held_for_first_time": "",
    "related_character": "",
    "detail": "Lễ hội chọi trâu Hải Lựu là một lễ hội chọi trâu diễn ra tại xã Hải Lựu, huyện Sông Lô (trước ngày 23/12/2008 thuộc huyện Lập Thạch), tỉnh Vĩnh Phúc.\n"
  },
  {
    "name": "Hội Xuân núi Bà",
    "id": "https://vi.wikipedia.org/w/index.php?title\u003dH%E1%BB%99i_Xu%C3%A2n_n%C3%BAi_B%C3%A0\u0026action\u003dedit\u0026redlink\u003d1",
    "start_date_lunar_calendar": "4/1",
    "location": "Tây Ninh, Núi Bà Đen",
    "held_for_first_time": "",
    "related_character": "Linh Sơn Thánh Mẫu",
    "detail": ""
  },
  {
    "name": "Lễ hội đình Yên Phụ",
    "id": "https://vi.wikipedia.org/wiki/Y%C3%AAn_Ph%E1%BB%A5",
    "start_date_lunar_calendar": "10/2",
    "location": "Hà Nội, Hồ Tây",
    "held_for_first_time": "",
    "related_character": "Uy Linh Lang, Vương Duy, Vương Ba",
    "detail": "Yên Phụ có thể là một trong số các địa danh sau:\n"
  },
  {
    "name": "Lễ hội Miếu Mạch Lũng",
    "id": "https://vi.wikipedia.org/wiki/Mi%E1%BA%BFu_M%E1%BA%A1ch_L%C5%A9ng",
    "start_date_lunar_calendar": "10/2",
    "location": "Hà Nội, Đông Anh",
    "held_for_first_time": "",
    "related_character": "Minh Mỗ Đại vương Thượng đẳng thần",
    "detail": "Miếu Mạch Lũng thuộc xã Đại Mạch, huyện Đông Anh, thành phố Hà Nội được Bộ Văn hóa - Thông tin Việt Nam cấp bằng công nhận Di tích lịch sử văn hóa năm 1993.\n"
  },
  {
    "name": "Lễ hội Quán Thế Âm",
    "id": "https://vi.wikipedia.org/wiki/Qu%C3%A1n_Th%E1%BA%BF_%C3%82m",
    "start_date_lunar_calendar": "19/2",
    "location": "Đà Nẵng, Ngũ Hành Sơn",
    "held_for_first_time": "",
    "related_character": "Quán Thế Âm Bồ Tát",
    "detail": "Quán Thế Âm (Tiếng Phạn: अवलोकितेश्वर nghĩa là \"Đấng quán chiếu âm thanh của thế gian\") là một vị Bồ-tát hiện thân cho lòng từ bi của tất cả chư Phật. Được miêu tả trong nhiều nền văn hóa khác nhau, cả thân nam lẫn thân nữ, Quán Thế Âm là một trong những vị Bồ-tát được tôn kính thờ phụng rộng rãi nhất trong Phật giáo Đại thừa, cũng như không chính thức trong Phật giáo Nguyên thủy.\n"
  },
  {
    "name": "Tiết Thanh minh",
    "id": "https://vi.wikipedia.org/wiki/Thanh_minh",
    "start_date_lunar_calendar": "",
    "location": "",
    "held_for_first_time": "",
    "related_character": "",
    "detail": "Tiết Thanh minh là một khái niệm trong công tác lập lịch của các nước phương Đông chịu ảnh hưởng của nền văn hóa Trung Hoa cổ đại. Nó là một trong số hai mươi tư tiết khí của các lịch Trung Quốc, Đài Loan, Việt Nam, Nhật Bản, Triều Tiên.\n"
  },
  {
    "name": "Hội đua voi",
    "id": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_%C4%91ua_voi",
    "start_date_lunar_calendar": "",
    "location": "Tây Nguyên",
    "held_for_first_time": "",
    "related_character": "",
    "detail": "Lễ hội đua voi là một trong những lễ hội quan trọng trong hệ thống các lễ hội cổ truyền của người vùng cao Tây Nguyên Việt Nam. Hội Đua Voi là một trong những hội của văn hóa truyền thống các dân tộc tỉnh Đắk Lắk được tổ chức 02 năm 01 lần vào tháng 3 âm lịch. Là Tháng của những con ong rừng đi lấy mật và cũng là thời điểm bắt đầu làm nương rẫy. Hội Đua Voi nhằm tôn vinh tinh thần thượng võ và tài nghệ thuần dưỡng voi của đồng bào các dân tộc Tây Nguyên.Ngoài ra, du khách đến đây cũng được thưởng thức ẩm thực độc đáo, đậm đà bản sắc của các dân tộc Tây Nguyên tại chỗ và được cưỡi voi tham quan buôn làng, trải nghiệm với hành trình cưỡi Voi lội sông Sêrêpốk tham quan Rừng Yok Don. Được tổ chức ở vùng Đắk Lắk. Một trong những lễ hội được xem là độc đáo nhất của nước Việt Nam ta.\n"
  },
  {
    "name": "Tết Hàn thực",
    "id": "https://vi.wikipedia.org/wiki/T%E1%BA%BFt_H%C3%A0n_th%E1%BB%B1c",
    "start_date_lunar_calendar": "3/3",
    "location": "",
    "held_for_first_time": "",
    "related_character": "Giới Tử Thôi, Tấn Văn Công",
    "detail": "Tết Hàn Thực hay Tết bánh trôi bánh chay là một ngày tết vào ngày mồng 3 tháng 3 Âm lịch. \"Hàn Thực\" nghĩa là \"thức ăn lạnh\". Ngày tết truyền thống này xuất hiện tại một số tỉnh của Trung Quốc, miền bắc Việt Nam và một số cộng đồng người gốc Hoa trên thế giới. Hàng năm vào ngày này, nhiều gia đình cho xay bột, đồ đỗ xanh, làm bánh trôi, bánh chay (ở Trung Quốc nấu chè trôi nước), nấu xôi chè lễ Phật và cúng gia tiên.\n"
  },
  {
    "name": "Hội Phủ Giầy",
    "id": "https://vi.wikipedia.org/wiki/Ph%E1%BB%A7_D%E1%BA%A7y",
    "start_date_lunar_calendar": "3/3",
    "location": "Nam Định, Vụ Bản",
    "held_for_first_time": "",
    "related_character": "Mẫu Liễu Hạnh",
    "detail": "Phủ Dầy (có khi ghi là Phủ Giầy, Phủ Giày) là một quần thể kiến trúc tín ngưỡng truyền thống của người Việt trải rộng trên địa bàn xã Kim Thái huyện Vụ Bản, tỉnh Nam Định, gần quốc lộ 10, quốc lộ 37B và quốc lộ 38B từ thành phố Nam Định đi thành phố Ninh Bình.\n"
  },
  {
    "name": "Lễ hội Điện Hòn Chén",
    "id": "https://vi.wikipedia.org/wiki/%C4%90i%E1%BB%87n_H%C3%B2n_Ch%C3%A9n",
    "start_date_lunar_calendar": "2/3",
    "location": "Thừa Thiên Huế, huyện Hương Trà",
    "held_for_first_time": "",
    "related_character": "Thiên Y A Na",
    "detail": "Điện Hòn Chén hay Huệ Nam Điện tọa lạc trên núi Ngọc Trản, thuộc làng Ngọc Hồ, phường Hương Hồ, thành phố Huế, tỉnh Thừa Thiên Huế. Núi Ngọc Trản xưa có tên là Hương Uyển Sơn, sau mới đổi tên là Ngọc Trản (có nghĩa là chén ngọc), dân gian vẫn quen gọi là Hòn Chén vì nó có liên quan đến giai thoại về vua Minh Mạng đánh rơi chén ngọc.\n"
  },
  {
    "name": "Lễ hội Chùa Thầy",
    "id": "https://vi.wikipedia.org/wiki/Ch%C3%B9a_Th%E1%BA%A7y",
    "start_date_lunar_calendar": "3/3",
    "location": "Hà Tây, Quốc Oai",
    "held_for_first_time": "",
    "related_character": "Từ Đạo Hạnh",
    "detail": "Chùa Thầy là một nhóm những ngôi chùa ở chân núi Sài Sơn, huyện Quốc Oai, tỉnh Hà Tây cũ, nay là xã Sài Sơn, huyện Quốc Oai, Hà Nội, cách trung tâm Hà Nội khoảng 20 km về phía Tây nam, đi theo đường cao tốc Láng - Hòa Lạc. Sài Sơn có tên Nôm là núi Thầy, nên chùa được gọi là chùa Thầy. Chùa được xây dựng từ thời nhà Lý. Đây từng là nơi tu hành của Thiền sư Từ Đạo Hạnh, lúc này núi Thầy còn gọi là núi Phật Tích.\n"
  },
  {
    "name": "Lễ hội Hoa Lư",
    "id": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Hoa_L%C6%B0",
    "start_date_lunar_calendar": "6/3",
    "location": "Ninh Bình, huyện Hoa Lư",
    "held_for_first_time": "",
    "related_character": "Đinh Bộ Lĩnh",
    "detail": "Lễ hội Hoa Lư là một lễ hội diễn ra hàng năm để tôn vinh vị anh hùng dân tộc Đinh Bộ Lĩnh đã xây dựng kinh đô Hoa Lư, lập ra nhà nước Đại Cồ Việt và mở đầu thời kỳ độc lập, thống nhất lâu dài của người Việt suốt các triều đại Đinh, Lê, Lý, Trần. Lễ hội Hoa Lư đã được xếp hạng là di sản văn hóa cấp quốc gia và đang được đề nghị nâng tầm tổ chức lễ hội theo nghi thức cấp nhà nước.[1] Lễ hội Hoa Lư là lễ hội đã có lịch sử lâu đời, phản ánh đậm nét, sinh động về cuộc đời, thân thế và sự nghiệp của đức vua Đinh Tiên Hoàng và lịch sử Việt Nam qua ba triều đại Đinh, Lê, Lý. Lễ hội Hoa Lư xưa được các vương triều phong kiến tổ chức trang trọng ở cấp Nhà nước. Hiện nay, lễ hội Hoa Lư vẫn là lễ hội có tầm ảnh hưởng lớn, bảo lưu được những yếu tố văn hóa, văn nghệ dân gian đặc sắc và đang hướng tới nâng cấp thành quốc lễ.\n"
  },
  {
    "name": "Lễ hội đền Thái Vi",
    "id": "https://vi.wikipedia.org/wiki/%C4%90%E1%BB%81n_Th%C3%A1i_Vi#Lễ_hội_đền_Thái_Vi",
    "start_date_lunar_calendar": "14/3",
    "location": "Ninh Bình, huyện Hoa Lư",
    "held_for_first_time": "",
    "related_character": "Trần Thái Tông, Trần Thánh Tông, Trần Nhân Tông, Trần Anh Tông, Hiển Từ Hoàng Thái Hậu",
    "detail": "Hành cung Vũ Lâm là một căn cứ quân sự thời Trần, nằm ngay trong vùng núi thành Nam của kinh đô Hoa Lư xưa. Các vua đầu nhà Trần lập căn cứ địa ở Vũ Lâm để củng cố lực lượng, phản công giải phóng Đại Việt trong cuộc kháng chiến đánh tan quân xâm lược Nguyên Mông lần thứ hai. Nơi đây còn gắn với sự kiện các vua Trần xuất gia tu hành, mở mang phật giáo. Hiện nay, hành cung Vũ Lâm thuộc quần thể di sản thế giới Tràng An, tỉnh Ninh Bình, một phần khu vực nằm sâu trong dãy núi Tràng An được đưa vào khai thác du lịch.\n"
  },
  {
    "name": "Lễ hội Nam Trì",
    "id": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Nam_Tr%C3%AC",
    "start_date_lunar_calendar": "8/3",
    "location": "Hưng Yên, huyện Ân Thi",
    "held_for_first_time": "",
    "related_character": "Lang Công, Bảo Công, Công chúa Hùng vương Lâu nương",
    "detail": "Lễ hội Nam Trì là lễ hội tế Thần có từ thế kỷ thứ 2 trước Công nguyên của trang Nam Trì (nay là làng Nam Trì xã Đặng Lễ huyện Ân Thi tỉnh Hưng Yên, dân gian gọi là Lễ hội Bảo, Lang, Biền. Bảo, Lang, Biền là ba vị Thượng đẳng Phúc thần Dực bảo trung hưng Bản cảnh Thành hoàng Đại vương thờ tại đền Nam Trì.\n"
  },
  {
    "name": "Giỗ tổ Hùng Vương",
    "id": "https://vi.wikipedia.org",
    "start_date_lunar_calendar": "10/3",
    "location": "Nhiều nơi ở Việt Nam",
    "held_for_first_time": "Nhà Đinh",
    "related_character": "Vua Hùng",
    "detail": ""
  },
  {
    "name": "Lễ hội đền Mẫu",
    "id": "https://vi.wikipedia.org/wiki/%C4%90%E1%BB%81n_M%E1%BA%ABu",
    "start_date_lunar_calendar": "10/3",
    "location": "Hưng Yên, Phố Hiến",
    "held_for_first_time": "",
    "related_character": "Dương Quý Phi",
    "detail": "Đền Mẫu có thể là một trong các công trình tín ngưỡng tại Việt Nam sau đây:\n"
  },
  {
    "name": "Lễ hội Làng cá Cát Bà",
    "id": "https://vi.wikipedia.org",
    "start_date_lunar_calendar": "",
    "location": "Hải Phòng, huyện Cát Hải, Thị trấn Cát Bà",
    "held_for_first_time": "",
    "related_character": "Hồ Chí Minh",
    "detail": ""
  },
  {
    "name": "Hội Gióng Phù Đổng",
    "id": "https://vi.wikipedia.org",
    "start_date_lunar_calendar": "7/4",
    "location": "Hà Nội, huyện Gia Lâm",
    "held_for_first_time": "",
    "related_character": "Thánh Gióng",
    "detail": ""
  },
  {
    "name": "Lễ Phật Đản",
    "id": "https://vi.wikipedia.org/wiki/L%E1%BB%85_Ph%E1%BA%ADt_%C4%90%E1%BA%A3n",
    "start_date_lunar_calendar": "8/4",
    "location": "Nhiều quốc gia",
    "held_for_first_time": "",
    "related_character": "Phật Tất Đạt Đa",
    "detail": "Phật Đản (chữ Nho 佛誕 - nghĩa là ngày sinh của đức Phật) hay là Vesak (tiếng Phạn: Vaiśākha, Devanagari: वैशाख, Sinhala: වෙසක් පෝය) là ngày kỷ niệm Phật Tất-đạt-đa Cồ-đàm sinh ra tại vườn Lâm-tì-ni năm 624 TCN, diễn ra vào ngày 8 tháng 4 âm lịch hoặc 15 tháng 4 hàng năm, tùy theo quốc gia.\n"
  },
  {
    "name": "Lễ hội Chol Chnam Thmay",
    "id": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Chol_Chnam_Thmay",
    "start_date_lunar_calendar": "14/4",
    "location": "Nam Bộ",
    "held_for_first_time": "",
    "related_character": "",
    "detail": "Chol Chnam Thmay (hoặc Chaul Chnam Thmay) là lễ hội mừng năm mới theo lịch cổ truyền của dân tộc Khmer. Chôl nghĩa là Vào và Chnăm Thmay là Năm Mới. Lễ Chôl Chnăm Thmay cũng là những ngày Tết của Campuchia, Lào, Thái Lan, Myanmar, Sri Lanka. Ngoài tôn giáo chính là Phật giáo, người Khmer còn tin rằng mỗi năm có một vị thần trên trời (Têvôđa) được sai xuống để chăm lo cho cuộc sống và con người trong năm đó, hết năm lại về trời để vị thần khác xuống hạ giới. Những ngày này trở thành, lễ hội truyền thống của cả cộng đồng. Tổ chức nhiều trò vui như đốt đèn trời, đốt ông lói, đánh quay lửa... Các cụ già kể cổ tích, thần thoại, chuyện cũ cho con cháu nghe.\n"
  },
  {
    "name": "Lễ khao lề thế lính",
    "id": "https://vi.wikipedia.org/wiki/L%E1%BB%85_khao_l%E1%BB%81_th%E1%BA%BF_l%C3%ADnh",
    "start_date_lunar_calendar": "18/3",
    "location": "Quảng Ngãi, huyện Lý Sơn",
    "held_for_first_time": "",
    "related_character": "",
    "detail": "Lễ khao lề thế lính là một lễ hội được nhân dân huyện đảo Lý Sơn, tỉnh Quảng Ngãi duy trì hàng trăm năm nay[1]. Thời gian đầu khi mới thành lập Đội Hoàng Sa, cứ hàng năm người của đảo Lý Sơn lại được tuyển mộ vào đội này làm binh, phu đi khai thác và bảo vệ Hoàng Sa và Trường Sa. Việc này gọi là \"thế lính\". Lễ khao lề thế lính là một lễ hội độc đáo với truyền thống uống nước nhớ nguồn nhằm ghi nhớ công ơn người xưa hay nhóm An Vĩnh thuộc hải đội Hoàng Sa đã ra đi tìm kiếm sản vật và cắm mốc biên giới hải phận mà không trở về[2].\n"
  },
  {
    "name": "Lễ hội miếu Bà Chúa Xứ",
    "id": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_mi%E1%BA%BFu_B%C3%A0_Ch%C3%BAa_X%E1%BB%A9",
    "start_date_lunar_calendar": "23/4",
    "location": "Miếu Bà Chúa Xứ, Núi Sam, An Giang, Châu Đốc",
    "held_for_first_time": "",
    "related_character": "Bà Chúa Xứ",
    "detail": "Lễ hội miếu Bà Chúa Xứ còn gọi lễ Vía Bà là một lễ hội của người dân Nam bộ, nằm dưới Núi Sam. Thành phố Châu Đốc, tỉnh An Giang, hàng năm đã thu hút trên 2 triệu lượt khách hành hương[1]\n"
  },
  {
    "name": "Tết Đoan ngọ",
    "id": "https://vi.wikipedia.org",
    "start_date_lunar_calendar": "5/5",
    "location": "Nhiều quốc gia",
    "held_for_first_time": "",
    "related_character": "",
    "detail": ""
  },
  {
    "name": "Thất Tịch",
    "id": "https://vi.wikipedia.org/wiki/Th%E1%BA%A5t_T%E1%BB%8Bch",
    "start_date_lunar_calendar": "7/7",
    "location": "Nhiều quốc gia",
    "held_for_first_time": "",
    "related_character": "Ngưu Lang, Chức Nữ",
    "detail": "Thất Tịch (Hán-Nôm: 七夕) hay còn gọi là Tết Ngâu, Ngày Ông Ngâu Bà Ngâu, theo văn hóa phương Đông, (Châu Á), lễ được tổ chức ngày 7 tháng 7 Âm lịch, đôi khi được người phương Tây gọi là ngày Valentine Đông Á. Lịch sử ngày này gắn bó với câu chuyện Ngưu Lang Chức Nữ hoặc vợ chồng Ngâu với nhiều dị bản. Theo truyền thuyết, sau một năm xa cách, cứ đến ngày này hằng năm, Ngưu Lang và Chức Nữ được gặp nhau bên cầu Ô Thước.[1]\n"
  },
  {
    "name": "Lễ Vu Lan, Tết Trung Nguyên",
    "id": "https://vi.wikipedia.org/wiki/Vu-lan",
    "start_date_lunar_calendar": "15/7",
    "location": "Nhiều quốc gia",
    "held_for_first_time": "",
    "related_character": "Bồ tát Mục Liên",
    "detail": "Vu lan (chữ Hán: 盂蘭, bính âm: yúlán), còn được gọi là lễ báo hiếu, là một trong những ngày lễ chính của Phật giáo (Đại thừa Bắc tông) và phong tục Việt Nam, Trung Hoa.\n"
  },
  {
    "name": "Lễ hội Nghinh Ông (Quan Thánh Đế Quân)",
    "id": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Nghinh_%C3%94ng_Quan_Th%C3%A1nh_%C4%90%E1%BA%BF_Qu%C3%A2n",
    "start_date_lunar_calendar": "",
    "location": "Phan Thiết (Bình Thuận)",
    "held_for_first_time": "",
    "related_character": "",
    "detail": "Lễ hội Nghinh Ông Quan Thánh Đế Quân là một lễ hội của người Hoa tại Phan Thiết. Lễ hội truyền thống này tiêu biểu cho phong tục tập quán và tín ngưỡng của người Hoa, ước mong cho quốc thái dân an, mưa thuận gió hòa, cho một cuộc sống thanh bình, mọi người trong xã hội được ấm no hạnh phúc.\n"
  },
  {
    "name": "Lễ hội Katê",
    "id": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Kat%C3%A9",
    "start_date_lunar_calendar": "",
    "location": "Bình Thuận",
    "held_for_first_time": "",
    "related_character": "",
    "detail": "Lễ hội Katé còn được gọi là Mbang Katé là một lễ hội của đồng bào dân tộc Chăm.[1] Đây là một lễ hội dân gian thiêng liêng đặc sắc và rất quan trọng. Tưởng nhớ đến những người đã khuất, tưởng nhớ đến các vị anh hùng dân tộc (được người Chăm tôn vinh làm thần). Thường được tổ chức vào 1 tháng 7 theo lịch của người Chăm (khoảng 25/9 đến 25/10 dương lịch). Người dân tập trung tại các đền tháp cổ kính, thưởng thức các điệu múa nhạc dân gian trong kho tàng âm nhạc của người Chăm. Mọi người nghỉ ngơi và tràn ngập niềm vui, đi thăm viếng chúc tụng lẫn nhau. Lễ hội được chia làm hai phần là phần lễ và phần hội\n"
  },
  {
    "name": "Lễ hội chọi trâu",
    "id": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_ch%E1%BB%8Di_tr%C3%A2u_%C4%90%E1%BB%93_S%C6%A1n",
    "start_date_lunar_calendar": "9/8",
    "location": "Hải Phòng, Đồ Sơn",
    "held_for_first_time": "",
    "related_character": "",
    "detail": "Lễ hội chọi trâu Đồ Sơn, còn gọi là đấu ngưu , là một tập tục cổ, có từ xa xưa, một lễ hội truyền thống của người dân vạn chài tại vùng biển Đồ Sơn, Hải Phòng; diễn ra vào ngày 9 tháng 8 Âm lịch hàng năm; di sản văn hóa phi vật thể quốc gia năm 2013 của Việt Nam.[1][2] Đây là một lễ hội với lễ nghi trang trọng, rước kiệu thần, có lọng che, phường bát âm...[3].\n"
  },
  {
    "name": "Tết Trung Thu",
    "id": "https://vi.wikipedia.org",
    "start_date_lunar_calendar": "15/8",
    "location": "Nhiều quốc gia",
    "held_for_first_time": "",
    "related_character": "Hằng Nga, Hậu Nghệ, Đường Minh Hoàng, Chú Cuội",
    "detail": ""
  },
  {
    "name": "Hội Đền Kiếp Bạc",
    "id": "https://vi.wikipedia.org/wiki/%C4%90%E1%BB%81n_Ki%E1%BA%BFp_B%E1%BA%A1c",
    "start_date_lunar_calendar": "15/8",
    "location": "Hải Dương, huyện Chí Linh",
    "held_for_first_time": "",
    "related_character": "Trần Hưng Đạo",
    "detail": "Đền Kiếp Bạc thuộc địa phận hai thôn Dược Sơn và Vạn Kiếp, xã Hưng Đạo, thành phố Chí Linh, tỉnh Hải Dương, Việt Nam; là nơi thờ phụng Hưng Đạo Đại Vương Trần Quốc Tuấn. Kiếp Bạc là tên ghép của hai vùng Vạn Yên (làng Kiếp) và Dược Sơn (làng Bạc). Đây là di tích quan trọng thuộc khu di tích Côn Sơn - Kiếp Bạc.\n"
  },
  {
    "name": "Hội Yến Diêu Trì",
    "id": "https://vi.wikipedia.org/w/index.php?title\u003dH%E1%BB%99i_Y%E1%BA%BFn_Di%C3%AAu_Tr%C3%AC\u0026action\u003dedit\u0026redlink\u003d1",
    "start_date_lunar_calendar": "15/8",
    "location": "Tây Ninh, Tòa Thánh Tây Ninh",
    "held_for_first_time": "",
    "related_character": "Cao Quỳnh Cư, Phạm Công Tắc, Cao Hoài Sang, Nguyễn Thị Hiếu",
    "detail": ""
  },
  {
    "name": "Lễ hội Nghinh Ông (Cá Voi)",
    "id": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_nghinh_%C3%94ng",
    "start_date_lunar_calendar": "",
    "location": "Bình Thuận, Tiền Giang",
    "held_for_first_time": "",
    "related_character": "",
    "detail": "Lễ hội nghinh Ông là lễ hội cúng cá Ông của ngư dân các tỉnh miền ven biển Việt Nam từ Quảng Bình trở vào Nam (gồm cả Phú Quốc)[1]. Đây là lễ hội cầu ngư: cầu cho biển lặng gió hòa, ngư dân may mắn làm ăn phát đạt, an khang. Lễ hội nghinh Ông là loại lễ hội nước lớn nhất của ngư dân. Có nhiều tên gọi khác nhau như lễ rước cốt ông, lễ cầu ngư, lễ tế cá \"Ông\", lễ cúng \"Ông\", lễ nghinh \"Ông\", lễ nghinh ông Thủy tướng, nhưng tất cả đều có chung một quan niệm rằng cá \"Ông\" là sinh vật thiêng ở biển, là cứu tinh đối với những người đánh cá và làm nghề trên biển nói chung. Điều này đã trở thành một tín ngưỡng dân gian phổ biến trong các thế hệ ngư dân ở các địa phương nói trên. Ở mỗi địa phương, lễ hội nghinh Ông diễn ra vào một thời điểm khác nhau.\n"
  },
  {
    "name": "Lễ hội AHDT Nguyễn Trung Trực",
    "id": "https://vi.wikipedia.org/w/index.php?title\u003dL%E1%BB%85_h%E1%BB%99i_AHDT_Nguy%E1%BB%85n_Trung_Tr%E1%BB%B1c\u0026action\u003dedit\u0026redlink\u003d1",
    "start_date_lunar_calendar": "",
    "location": "Rạch Giá, Kiên Giang",
    "held_for_first_time": "",
    "related_character": "Nguyễn Trung Trực",
    "detail": ""
  },
  {
    "name": "Lễ hội Chùa Keo",
    "id": "https://vi.wikipedia.org/wiki/Ch%C3%B9a_Keo",
    "start_date_lunar_calendar": "13/9",
    "location": "Thái Bình, Vũ Thư",
    "held_for_first_time": "",
    "related_character": "Thiền sư Không Lộ",
    "detail": "Chùa Keo là tên gọi của một số ngôi chùa cổ ở Việt Nam. Một số ngôi chùa Keo cổ được biết đến nhiều nhất là:\n"
  },
  {
    "name": "Tết cơm mới",
    "id": "https://vi.wikipedia.org/wiki/T%E1%BA%BFt_Song_th%E1%BA%ADp",
    "start_date_lunar_calendar": "15/10",
    "location": "Nhiều quốc gia",
    "held_for_first_time": "",
    "related_character": "",
    "detail": "Tết Song thập (Chữ Hán: 十成節, Hán Việt: Song thập tiết) (mùng 10 tháng 10 hoặc 15 tháng 10 Âm lịch) còn gọi là tết của các thầy thuốc, hay là Tết Trùng thập, Tết Thường tân, Tết Cơm mới tháng mười, có xuất xứ từ Trung Quốc.\n"
  },
  {
    "name": "Lễ hội đền Nguyễn Công Trứ",
    "id": "https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_%C4%91%E1%BB%81n_Nguy%E1%BB%85n_C%C3%B4ng_Tr%E1%BB%A9",
    "start_date_lunar_calendar": "13/11",
    "location": "Ninh Bình, huyện Kim Sơn",
    "held_for_first_time": "",
    "related_character": "Nguyễn Công Trứ",
    "detail": "Lễ hội đền Nguyễn Công Trứ là lễ hội lớn nhất của cư dân huyện mới ven biển Kim Sơn tỉnh Ninh Bình để ghi nhớ công ơn của Doanh điền Nguyễn Công Trứ - người đã chiêu dân khai hoang lấn biển lập ra huyện Kim Sơn (núi vàng) của Ninh Bình và Tiền Hải (biển bạc) của Thái Bình. Lễ hội diễn ra từ ngày 14 tháng 11 đến 16 tháng 11 âm lịch hàng năm để tưởng niệm ngày mất của ông.\n"
  },
  {
    "name": "Tiễn Ông Táo về trời",
    "id": "https://vi.wikipedia.org/wiki/T%C3%A1o_qu%C3%A2n",
    "start_date_lunar_calendar": "23/12",
    "location": "Nhiều quốc gia",
    "held_for_first_time": "",
    "related_character": "Thổ Công, Thổ địa, Thổ kỳ",
    "detail": "Táo Quân (Chữ Hán: 灶君); Táo Vương (灶王), Ông Táo (翁灶) hay Thần Bếp (神灶), Vua Bếp (Chữ Nôm: 𢂜灶) trong tín ngưỡng dân gian Việt Nam và Trung Hoa được xem là vị thần cai quản việc bếp núc trong mỗi nhà; Táo (灶) có nghĩa là bếp. Việt Nam và Trung Hoa có những truyền thuyết về Táo Quân khác nhau.\n"
  },
  {
    "name": "Tết Nguyên Đán",
    "id": "https://vi.wikipedia.org/wiki/T%E1%BA%BFt_Nguy%C3%AAn_%C4%90%C3%A1n",
    "start_date_lunar_calendar": "1/1",
    "location": "Nhiều quốc gia",
    "held_for_first_time": "",
    "related_character": "",
    "detail": "Đánh dấu ngày đầu tiên của năm mới theo lịch âm"
  }
]